todo/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Woo"], ["note", "this took a long time"], ["created_at", 2016-12-11 11:49:10 UTC], ["updated_at", 2016-12-11 11:49:10 UTC]]
SELECT "tasks".* FROM "tasks"
---
    def create
        @task = Task.create(task_params)
        @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
SELECT "tasks".* FROM "tasks"
---
    def destroy
        @task = Task.find(params[:id])
        @task.destroy
        @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", Sun, 12 Jun 2016], ["updated_at", 2016-12-11 12:49:46 UTC], ["id", 6]]
SELECT "tasks".* FROM "tasks"
---
    def update
        @task = Task.find(params[:id])
        @task.update_attributes(task_params)
        @tasks = Task.all